rescosta/ReefBlueSky-Kh/esp32/ReefBlueSky_KH_Monitor_v3/CloudAuth.cpp
    // Renovar se vai expirar em menos de 1 hora
    if (tokenExpiry - now > 3600) {
        return true;  // Token ainda válido
    }
    
    Serial.println("[CloudAuth::refreshTokenIfNeeded] Renovando token...");
    
    if (!rateLimiter.canMakeRequest()) {
        Serial.println("[CloudAuth::refreshTokenIfNeeded] Rate limit atingido");
        return false;
    }
    
    //if (!validateSSLCertificate()) {
    //    Serial.println("[CloudAuth::refreshTokenIfNeeded] Validação SSL falhou");
    //    return false;
   // }
    
    //WiFiClientSecure client;
    WiFiClient client;
    //if (ca_cert != nullptr) client.setCACert(ca_cert);
    
    HTTPClient http;
    String url = serverUrl + "/device/refresh-token";
    
    http.begin(client, url);
    http.addHeader("Content-Type", "application/json");
    http.addHeader("Authorization", "Bearer " + refreshToken);
    
    // [SEGURANÇA] Adicionar timestamp para proteção contra replay
    DynamicJsonDocument doc(256);
    doc["timestamp"] = now;
    doc["deviceId"] = deviceId;
    
    String payload;
    serializeJson(doc, payload);
    
    int httpCode = http.POST(payload);
    
    if (httpCode == 200) {
        String response = http.getString();
        DynamicJsonDocument responseDoc(512);
        DeserializationError err = deserializeJson(responseDoc, response);
        if (!err && responseDoc["success"]) {
            JsonObject data = responseDoc["data"];
            if (data.containsKey("token")) {
                String newToken = data["token"].as<String>();
                unsigned long newExpiry = data["expiresIn"].as<unsigned long>();

                deviceToken = newToken;
                tokenExpiry = now + newExpiry;

                storeTokenSecurely(deviceToken, refreshToken, tokenExpiry);

                Serial.println("[CloudAuth::refreshTokenIfNeeded] Token renovado com sucesso");
                http.end();
                return true;
            }
        }
    }

    
    Serial.printf("[CloudAuth::refreshTokenIfNeeded] Erro ao renovar token: %d\n", httpCode);
    http.end();
    return false;
}

// ============================================================================
// [SEGURANÇA] Validação de Certificado SSL/TLS
// ============================================================================

bool CloudAuth::validateSSLCertificate() {
    // [SEGURANÇA] Validar certificado do servidor
    // Em produção, usar certificate pinning com SHA256 fingerprint
    
    Serial.println("[CloudAuth::validateSSLCertificate] Validando certificado SSL...");
    
    // Verificação simplificada
    // Em produção, implementar verificação completa com mbedtls
    
    return true;
}

// ============================================================================
// [SEGURANÇA] Obter Token Válido
// ============================================================================

String CloudAuth::getAuthToken() {
    if (deviceToken.length() == 0) {
        Serial.println("[CloudAuth::getAuthToken] Token não disponível");
        return "";
    }
    
    return deviceToken;
}

// ============================================================================
// [FUNCIONALIDADE] Fila de Medições Offline
// ============================================================================

void CloudAuth::queueMeasurement(const Measurement& m) {
    if (offlineMeasurementQueue.size() >= MAX_QUEUE_SIZE) {
        Serial.println("[CloudAuth::queueMeasurement] Fila cheia, removendo medição antiga");
        offlineMeasurementQueue.pop();
    }
    
    offlineMeasurementQueue.push(m);
    Serial.printf("[CloudAuth::queueMeasurement] Medição enfileirada. Fila: %d\n", offlineMeasurementQueue.size());
}

// ============================================================================
// [FUNCIONALIDADE] Sincronização Incremental (sem wrapper/compressão)
// ============================================================================

bool CloudAuth::syncOfflineMeasurements() {
    if (offlineMeasurementQueue.empty()) {
        Serial.println("[CloudAuth::syncOfflineMeasurements] Nenhuma medição para sincronizar");
        return true;
    }

    /*if (!rateLimiter.canMakeRequest()) {
        Serial.println("[CloudAuth::syncOfflineMeasurements] Rate limit atingido");
        return false;
    }*/

    Serial.printf("[CloudAuth::syncOfflineMeasurements] Sincronizando %d medições...\n", offlineMeasurementQueue.size());

//    if (!validateSSLCertificate()) {
//        Serial.println("[CloudAuth::syncOfflineMeasurements] Validação SSL falhou");
//        return false;
//    }

//    WiFiClientSecure client;
      WiFiClient client;  
//    if (ca_cert != nullptr) client.setCACert(ca_cert);
      HTTPClient http;
      String url = String(serverUrl) + "/device/sync";
      http.begin(client, url);

    
    http.addHeader("Content-Type", "application/json");
    http.addHeader("Authorization", "Bearer " + deviceToken);

    // Extrair medições da fila em chunks
    std::vector<Measurement> chunk;
    int chunkSize = incrementalSync.getChunkSize();

    while (!offlineMeasurementQueue.empty() && (int)chunk.size() < chunkSize) {
        chunk.push_back(offlineMeasurementQueue.front());
        offlineMeasurementQueue.pop();
    }

    // Montar payload exatamente como o Postman
    DynamicJsonDocument doc(4096);
    JsonArray measurementsArray = doc.createNestedArray("measurements");

    for (const auto& m : chunk) {
        JsonObject obj = measurementsArray.createNestedObject();
        obj["timestamp"]   = m.timestamp;          // mesmo campo do Postman
        obj["kh"]          = m.kh;
        obj["phref"]       = m.ph_reference;
        obj["phsample"]    = m.ph_sample;
        obj["temperature"] = m.temperature;
        obj["status"]      = m.is_valid ? "ok" : "invalid";
        obj["confidence"]  = m.confidence;
    }

    String payload;
    serializeJson(doc, payload);
    Serial.println("[SYNC] Payload:");
    Serial.println(payload);

