rescosta/ReefBlueSky-Kh/esp32/ReefBlueSky_KH_Monitor_v3/CloudAuth.cpp
    int httpCode = http.POST(payload);
    Serial.printf("[SYNC] httpCode = %d\n", httpCode);

        // se token expirou, marca desconectado para o loop reconectar
        if (httpCode == 401 || httpCode == 403) {
            Serial.println("[CloudAuth::syncOfflineMeasurements] Token inválido/expirado (401/403). Limpando token.");
            deviceToken = "";
            tokenExpiry = 0;
            http.end();
            for (const auto& m : chunk) {
                queueMeasurement(m);
        }
        return false;
    }

    if (httpCode <= 0) {
        Serial.printf("[SYNC] Erro HTTP: %s\n", http.errorToString(httpCode).c_str());
    }

    if (httpCode == 200) {
        String response = http.getString();
        DynamicJsonDocument responseDoc(512);
        DeserializationError err = deserializeJson(responseDoc, response);
        if (!err && responseDoc["success"]) {
            // Atualizar checkpoint de sincronização
            if (!chunk.empty()) {
                incrementalSync.updateLastSyncedTimestamp(chunk.back().timestamp);
            }

            Serial.printf("[CloudAuth::syncOfflineMeasurements] %d medições sincronizadas com sucesso\n", chunk.size());
            http.end();

            // Continuar sincronizando se ainda há medições
            if (!offlineMeasurementQueue.empty()) {
                delay(1000);  // Aguardar antes de próxima sincronização
                return syncOfflineMeasurements();
            }

            return true;
        } else {
            Serial.println("[CloudAuth::syncOfflineMeasurements] Resposta 200 mas JSON inválido ou success=false");
        }
    }

    Serial.printf("[CloudAuth::syncOfflineMeasurements] Erro ao sincronizar: %d\n", httpCode);

    // Recolocar medições na fila se falhar
    for (const auto& m : chunk) {
        queueMeasurement(m);
    }

    http.end();
    return false;
}


// ============================================================================
// [SEGURANÇA] Enviar Heartbeat com Validação
// ============================================================================

bool CloudAuth::sendHeartbeat(const DeviceStatus& status) {
    if (!rateLimiter.canMakeRequest()) {
        return false;
    }
    
    //if (!validateSSLCertificate()) {
    //    return false;
   // }
    
    //WiFiClientSecure client;
    WiFiClient client;
    //if (ca_cert != nullptr) client.setCACert(ca_cert);
    
    HTTPClient http;
    String url = serverUrl + "/device/ping?deviceId=" + deviceId;
    
    http.begin(client, url);

    
    http.addHeader("Authorization", "Bearer " + deviceToken);
    
    int httpCode = http.GET();
    
    if (httpCode == 401 || httpCode == 403) {
        Serial.println("[CloudAuth::sendHeartbeat] Token inválido/expirado (401/403). Limpando token.");
        deviceToken = "";
        tokenExpiry = 0;
        http.end();
        return false;
    }

    if (httpCode == 200) {
        String response = http.getString();
        DynamicJsonDocument responseDoc(512);
        deserializeJson(responseDoc, response);
        
        // [SEGURANÇA] Validar timestamp do servidor
        if (responseDoc.containsKey("timestamp")) {
            unsigned long serverTime = responseDoc["timestamp"];
            if (!replayProtection.validateTimestamp(serverTime)) {
                Serial.println("[CloudAuth::sendHeartbeat] Validação de timestamp falhou");
                http.end();
                return false;
            }
        }
        
        Serial.println("[CloudAuth::sendHeartbeat] Heartbeat enviado com sucesso");
        http.end();
        return true;
    }
    
    Serial.printf("[CloudAuth::sendHeartbeat] Erro ao enviar heartbeat: %d\n", httpCode);
    http.end();
    return false;
}

// ============================================================================
// [SEGURANÇA] Enviar Métricas de Saúde do Sistema
// ============================================================================
bool CloudAuth::sendHealthMetrics(const SystemHealth& health) {
    if (!rateLimiter.canMakeRequest()) {
        return false;
    }

    WiFiClient client;
    HTTPClient http;
    String url = serverUrl + String("/device/health");

    http.begin(client, url);
    http.addHeader("Content-Type", "application/json");
    http.addHeader("Authorization", "Bearer " + deviceToken);

    DynamicJsonDocument doc(512);

    // Força os tipos corretos no JSON
    doc["cpuusage"]     = health.cpu_usage;
    doc["memoryusage"]  = health.memory_usage;
    doc["storageusage"] = health.spiffs_usage;
    doc["wifirssi"]     = health.wifi_signal_strength;
    doc["uptime"]       = health.uptime;

    String payload;
    serializeJson(doc, payload);

    Serial.printf("[CloudAuth] Payload final: %s\n", payload.c_str());

    int httpCode = http.POST(payload);
    Serial.printf("[CloudAuth::sendHealthMetrics] HTTP Code: %d\n", httpCode);

    if (httpCode == 200) {
        Serial.println("[CloudAuth::sendHealthMetrics] ✓ Sucesso");
        http.end();
        return true;
    }

    Serial.printf("[CloudAuth::sendHealthMetrics] ✗ Erro %d\n", httpCode);
    http.end();
    return false;
}

// ============================================================================
// Obter KH de referência do servidor (se existir)
// ============================================================================

bool CloudAuth::fetchReferenceKH(float& outKhRef) {
    if (!rateLimiter.canMakeRequest()) {
        return false;
    }

    WiFiClient client;
    HTTPClient http;
    String url = String(serverUrl) + "/device/kh-reference";

    http.begin(client, url);
    http.addHeader("Authorization", "Bearer " + deviceToken);

    int httpCode = http.GET();

    if (httpCode == 401 || httpCode == 403) {
        Serial.println("[CloudAuth::fetchReferenceKH] Token inválido/expirado (401/403). Limpando token.");
        deviceToken = "";
        tokenExpiry = 0;
        http.end();
        return false;
    }

    if (httpCode != 200) {
        Serial.printf("[CloudAuth::fetchReferenceKH] HTTP %d\n", httpCode);
        http.end();
        return false;
    }

    String response = http.getString();
    StaticJsonDocument<256> doc;
    DeserializationError err = deserializeJson(doc, response);
    if (err) {
        Serial.printf("[CloudAuth::fetchReferenceKH] JSON inválido: %s\n", err.c_str());
        http.end();
        return false;
    }

    bool success = doc["success"] | false;
    if (!success || doc["data"].isNull()) {
        Serial.println("[CloudAuth::fetchReferenceKH] Sem KH referência no servidor");
        http.end();
        return false;
    }

    float v = doc["data"]["khreference"] | 0.0f;
    if (v <= 0.0f || v > 25.0f) {
        Serial.println("[CloudAuth::fetchReferenceKH] KH inválido no servidor");
        http.end();
        return false;
    }

    outKhRef = v;
    http.end();
    return true;
}



// ============================================================================
// [SEGURANÇA] Obter Comandos do Servidor com Validação
// ============================================================================

bool CloudAuth::pullCommandFromServer(Command& command) {
    if (!rateLimiter.canMakeRequest()) {
        return false;
    }

