rescosta/ReefBlueSky-Kh/esp32/ReefBlueSky_KH_Monitor_v3/CloudAuth.cpp
    WiFiClient client;
    HTTPClient http;
    String url = String(serverUrl) + "/device/commands/poll";

    http.begin(client, url);
    http.addHeader("Authorization", "Bearer " + deviceToken);
    http.addHeader("Content-Type", "application/json");

    int httpCode = http.POST("{}");

    if (httpCode == 401 || httpCode == 403) {
        Serial.println("[CloudAuth::pullCommandFromServer] Token inválido/expirado (401/403). Limpando token.");
        deviceToken = "";
        tokenExpiry = 0;
        http.end();
        return false;
    }

    if (httpCode == 200) {
        String response = http.getString();

        Serial.println("[CloudAuth] resposta recebida:");
        Serial.println(response);

        DynamicJsonDocument responseDoc(2048);
        DeserializationError err = deserializeJson(responseDoc, response);
        if (err) {
            Serial.printf("[CloudAuth::pullCommandFromServer] JSON inválido: %s\n", err.c_str());
            http.end();
            return false;
        }

        if (!responseDoc["success"]) {
            http.end();
            return false;
        }

        JsonArray arr = responseDoc["data"].as<JsonArray>();
        Serial.printf("[CloudAuth] data size=%d\n", arr.size());

        if (!arr || arr.size() == 0) {
            http.end();
            return false; // sem comandos pendentes
        }

        JsonObject cmdObj = arr[0];

        String type = cmdObj["type"].as<String>();

        if (!commandValidator.isCommandAllowed(type)) {
            Serial.println("[CloudAuth::pullCommandFromServer] Comando não permitido");
            http.end();
            return false;
        }

        command.command_id = String(cmdObj["id"].as<int>());
        command.action     = type;

        // aqui você limpa o documento antes de reutilizar
        command.paramsDoc.clear();
        JsonObject dst = command.paramsDoc.to<JsonObject>();
        JsonVariant payloadVar = cmdObj["payload"];
        if (payloadVar.is<JsonObject>()) {
            JsonObject src = payloadVar.as<JsonObject>();
            for (JsonPair kv : src) {
                dst[kv.key()] = kv.value();
            }
        }
        // reata params ao paramsDoc
        command.params = command.paramsDoc.as<JsonObject>();

        Serial.printf("[CloudAuth::pullCommandFromServer] Comando recebido: %s\n", type.c_str());
        http.end();
        return true;
    }

    Serial.printf("[CloudAuth::pullCommandFromServer] Erro HTTP: %d\n", httpCode);
    http.end();
    return false;
}

// ============================================================================
// [SEGURANÇA] Confirmar Execução de Comando
// ============================================================================

bool CloudAuth::confirmCommandExecution(const String& commandId,
                                        const String& status,
                                        const String& result) {
    if (!rateLimiter.canMakeRequest()) {
        return false;
    }

    WiFiClient client;
    HTTPClient http;
    String url = String(serverUrl) + "/device/commands/complete";

    http.begin(client, url);
    http.addHeader("Content-Type", "application/json");
    http.addHeader("Authorization", "Bearer " + deviceToken);

    DynamicJsonDocument doc(512);
    doc["commandId"] = commandId.toInt();   // backend espera número
    doc["status"] = status;                // ex.: "done" ou "error"
    if (result.length() > 0) {
        doc["errorMessage"] = result;      // só envia se tiver erro
    }

    String payload;
    serializeJson(doc, payload);

    int httpCode = http.POST(payload);

    if (httpCode == 401 || httpCode == 403) {
        Serial.println("[CloudAuth::confirmCommandExecution] Token inválido/expirado (401/403). Limpando token.");
        deviceToken = "";
        tokenExpiry = 0;
        http.end();
        return false;
    }

    if (httpCode == 200) {
        Serial.printf("[CloudAuth::confirmCommandExecution] Execução confirmada: %s\n", commandId.c_str());
        http.end();
        return true;
    }
    

    Serial.printf("[CloudAuth::confirmCommandExecution] Erro ao confirmar: %d\n", httpCode);
    http.end();
    return false;
}


// ============================================================================
// [FUNCIONALIDADE] Compressão de Dados com GZIP
// ============================================================================

String CloudAuth::compressMeasurements(const std::vector<Measurement>& measurements) {
    DynamicJsonDocument doc(8192);
    JsonArray array = doc.createNestedArray("measurements");
    
    for (const auto& m : measurements) {
        JsonObject obj = array.createNestedObject();
        obj["ts"] = m.timestamp;
        obj["kh"] = m.kh;
        obj["ph_r"] = m.ph_reference;
        obj["ph_s"] = m.ph_sample;
        obj["t"] = m.temperature;
        obj["v"] = m.is_valid;
        obj["c"] = m.confidence;
    }
    
    String json;
    serializeJson(doc, json);
    
    // [FUNCIONALIDADE] Comprimir com GZIP
    // Nota: Implementação simplificada
    // Em produção, usar biblioteca de compressão apropriada
    
    return json;  // Retornar JSON (compressão será adicionada em produção)
}

// ============================================================================
// [FUNCIONALIDADE] Verificar Conectividade
// ============================================================================

bool CloudAuth::isConnected() {
    return WiFi.isConnected() && deviceToken.length() > 0;
}

